# BodyShowsVerticalHeaders Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..BodyShowsVerticalHeaders Property
PanelScheduleData Class See Also
---
Shows text in the Load Summary section's headers vertically instead of horizontally
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool BodyShowsVerticalHeaders { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BodyShowsVerticalHeaders As Boolean
	Get
```

Visual C++
---
```text
public:
property bool BodyShowsVerticalHeaders {
	bool get ();
}
```

# Remarks
Setting this value must go through the appropriate update function (updateVerticalHeadersInSection)
# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace